
import { mutationTree,actionTree,getterTree } from 'typed-vuex'

// interface Product  {
//     id?: Number,
//     name: String,
//     description: String,
//     imagePath: String,
//     price: number,
//   }

export type RootState = ReturnType<typeof state>
export type UserState = {
    id: string,
    name: string,
    token: string,
    pic: string,
}

export const state = () => ({
    items :[
        {
                        id:1,
                        name:"ビニールプール",
                        description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                        材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                        水量目安:高さ22cmまで入れて295L
                        付属品:修理用パッチ
                        対象年齢:2歳以上
                        原産国:中国
                        INTEX社製のサンシェード付プール。
                        高さのある壁で安定します。
                        サンシェードは取り外し可能です。
                        プール底に排水口付き。
                        修理用パッチ付。
                        ご注意:子供は必ず、監視者のもとで遊ばせてください。
                        レンタル等による貸出、オークション等による販売や中古販売、
                        及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                        一切責任を負いかねますので予めご了承ください。`,
                        imagePath:"1.jpg",
                        price:1490
                    },
                    {
                                    id:2,
                                    name:"ラジコンバギー ボブキャットEX",
                                    description: `防塵防水仕様1/20スケールラジコンバギー。
                                    生活防水だから水たまりでの走行可能、汚れたら水かけ洗いもできる。
                                    前後サスペンション搭載で悪路を走破。
                                    登坂力35度、ハイスピード15キロ。
                                    デフギア搭載でクイックなコーナーリング。
                                    アウトドアでもガンガン走るラジコンバギー。
                                    <本体サイズ>H11.5×W16×D27.5cm`,
                                    imagePath:"2.jpg",
                                    price:1490
                                },
                                {
                                    id:3,
                                    name:"シルバニアファミリーSylvanian Families(赤い屋根の大きなお家",
                                    description: `お家は90度や180度に開いたり、閉じたりして遊ぶことができます。
                                    お家を閉じると、どこから見てもきれいなお家の形になり、窓からこぼれるお家のあかりがとてもきれいです。
                                    ３階のお部屋「えんとつのお部屋」と「屋根ユニット」が取り外せるようになっています。
                                    これらのお部屋を組みかえることで、３階建てのお家としても遊ぶことができます。`,
                                    imagePath:"3.jpg",
                                    price:1490
                                },
                                {
                                    id:4,
                                    name:"ハピネスチャージプリキュア! キュアライン",
                                    description: `ハピネスチャージプリキュア!が使用するスマホ「キュアライン」が登場!!
                                    流行のスタンプメールやTV電話でプリキュアたちとコミュニケーション!
                                    メールがきたら選択をして返信!スタンプも送れる!メールは800パターン以上!
                                    スタンプは100種類以上!
                                    メール&TV電話で仲良し度を上げてプロフをゲット!
                                    さらに、歴代プリキュアたちともスタンプメールができちゃう!
                                    また、遊んで学べる知育アプリやゲーム、実用アプリがいっぱい!
                                    タッチペンで文字や数字の書き方を学んだり、遊びながら学べる知育アプリが盛りだくさん。
                                    さらに!専用ホームページからデータをダウンロードしてゲームやキャラクターを追加できる! 
                                    (ゲーム、メールできるキャラクター、スタンプ)
                                    使用電池:単4×4 (別売) 
                                   【商品内容】キュアライン本体1個、タッチペン1個`,
                                    imagePath:"4.jpg",
                                    price:1900
                                },
                                {
                                    id:5,
                                    name:"こえだちゃん キキ & ララ 月のおうち",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"5.jpg",
                                    price:1900
                                },
                                {
                                    id:6,
                                    name:"キラキラ プリキュアアラモード まぜまぜ変身!スイーツパクトDX",
                                    description: `キラキラ プリキュアアラモードより、まぜまぜ変身!スイーツパクトDXが登場!
                                    プリキュア5人全員の変身&攻撃あそびが楽しめるオールインワンセット!
                                    スイーツづくりみたいな「まぜまぜアクション」で5人のなりきりあそびができる!!
                                    
                                    セット内容:スイーツパクト本体 1個 まぜまぜスティック 1本 アニマルスイーツ 
                                    うさぎショートケーキ1個 リスプリン1個 ライオンアイス1個 キャットマカロン1個 
                                    ドッグチョコレート1個 ボールチェーン1個 使用電池:単4×2(別売)
                                    
                                     ※デビューキャンペーンの先着購入特典、アニマルスイーツ「ペコリンムースケーキ」は付属しません。`,
                                    imagePath:"6.jpg",
                                    price:2700
                                },
                                {
                                    id:7,
                                    name:"アンパンマンタウン ようこそ！たのしいパンこうじょうハウス",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"7.jpg",
                                    price:2570
                                },
                                {
                                    id:8,
                                    name:"人生ゲーム（2016年ver.）",
                                    description: `人生ゲームシリーズのフラッグシップモデルが8年ぶりにリニューアル!! 
                                    4つの追加エリアを組み合わせることで、色んなテイストの人生ゲームが楽しめます!組み合わせパターンは全16種。 
                                    【セット内容】 
                                    億万長者ステージ(1),追加用ステージ(仮)(4), 山(ゲーム版に貼り付いているもの以外)(1),
                                    家(ゲーム版に貼りついているもの以外)(4), ビル群(1),追加ステージ用橋(4),橋(1),
                                    自動車ゴマ(6色 各1個)(6),旗(6色 各1本)(6), 人物ピン(水色36本、ピンク36本))(72),
                                    職業カード(A4サイズ)(1), お宝カード(A4サイズ)(1),保険証券(火災保険、生命保険、自動車保険)(24),
                                    株券(8),お札一式(1)`,
                                    imagePath:"8.jpg",
                                    price:2160
                                },
                                {
                                    id:9,
                                    name:"野球盤 3Dエース",
                                    description: `野球盤史上初！｢3Dピッチング機能｣を搭載し、ピッチャーの投球が本物のように飛びます！ 
                                    オーバースローとアンダースローで投げ分けて、ホームランバッターに挑め！ めざせ！完・全・試・合！ 
                                    [セット内容] 
                                    野球盤本体1、電光掲示板1、ホームランフェンス（直線・曲線）各2、外周フェンス（照明パーツ含む）2、
                                     グローブポケット4、バッターウィンドウ1、ボール6、バッター人形2、ピッチャー人形1、ランナー人形3、 
                                     フィールダー人形7、カウントピン3、シール1、バット用ゴム3、取扱説明書1`,
                                    imagePath:"9.jpg",
                                    price:2700
                                },
                                {
                                    id:10,
                                    name:"ベイブレードバースト　B-86 スターター",
                                    description: `ギミック付きのレイヤー搭載したディフェンスタイプの新型ベイブレード！ 
                                    ※ライトランチャーLR付属 
                                    
                                    ＜セット内容＞
                                     レイヤー(1),ディスク(1),ドライバー(1),ランチャー(1),ワインダー(1),取説(1),シール(1)`,
                                    imagePath:"10.jpg",
                                    price:2160
                                },
                                {
                                    id:11,
                                    name:"仮面ライダーエグゼイド　ダブル装填　DXガシャコン キースラッシャー",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"11.jpg",
                                    price:2700
                                },
                                {
                                    id:12,
                                    name:"トミカハイパーシリーズ ドライブヘッド",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"12.jpg",
                                    price:2160
                                },
                                {
                                    id:13,
                                    name:"ミニ四駆スターターパック　MAパワータイプ（ブラストアロー",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"13.jpg",
                                    price:2160
                                },
                                {
                                    id:14,
                                    name:"ミニ四駆スターターパック　MAパワータイプ（ブラストアロー）",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"14.jpg",
                                    price:2980
                                },
                                {
                                    id:15,
                                    name:"機動戦士ガンダムZZ ダブルゼータガンダム",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"15.jpg",
                                    price:2440
                                },
                                {
                                    id:16,
                                    name:"こえだちゃんと木のおうち",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"16.jpg",
                                    price:2700
                                },
                                {
                                    id:17,
                                    name:"キラペットドーム <アクセパーティー>",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"17.jpg",
                                    price:2440
                                },
                                {
                                    id:18,
                                    name:"おはじきシール ゆめかわDX",
                                    description: `製品サイズ:(約)幅157×奥行157×高さ122cm
                                    材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
                                    水量目安:高さ22cmまで入れて295L
                                    付属品:修理用パッチ
                                    対象年齢:2歳以上
                                    原産国:中国
                                    INTEX社製のサンシェード付プール。
                                    高さのある壁で安定します。
                                    サンシェードは取り外し可能です。
                                    プール底に排水口付き。
                                    修理用パッチ付。
                                    ご注意:子供は必ず、監視者のもとで遊ばせてください。
                                    レンタル等による貸出、オークション等による販売や中古販売、
                                    及び譲渡によって発生した故障・破損・損害・事故などにつきましては
                                    一切責任を負いかねますので予めご了承ください。`,
                                    imagePath:"18.jpg",
                                    price:2700
                                },
    ]
})

export const getters = getterTree(state,{
    getItemById: (state) => (id:number) => state.items.find((item) => item.id === id),

})

export const mutations = mutationTree(state, {
    
})




// import { Module, VuexModule, Mutation, Action } from 'vuex-module-decorators'

// interface Product  {
//     id?: Number,
//     name: String,
//     description: String,
//     imagePath: String,
//     price: number,
//   }


// @Module({
//   name: 'product',
//   stateFactory: true,
//   namespaced: true
// })

//   export default class Products extends VuexModule {
//     private todos: Product[] = []

//     private items : Product[] = [
//         {
//             id:1,
//             name:"ビニールプール",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"1.jpg",
//             price:1490
//         },
//         {
//             id:2,
//             name:"ラジコンバギー ボブキャットEX",
//             description: `防塵防水仕様1/20スケールラジコンバギー。
//             生活防水だから水たまりでの走行可能、汚れたら水かけ洗いもできる。
//             前後サスペンション搭載で悪路を走破。
//             登坂力35度、ハイスピード15キロ。
//             デフギア搭載でクイックなコーナーリング。
//             アウトドアでもガンガン走るラジコンバギー。
//             <本体サイズ>H11.5×W16×D27.5cm`,
//             imagePath:"2.jpg",
//             price:1490
//         },
//         {
//             id:3,
//             name:"シルバニアファミリーSylvanian Families(赤い屋根の大きなお家",
//             description: `お家は90度や180度に開いたり、閉じたりして遊ぶことができます。
//             お家を閉じると、どこから見てもきれいなお家の形になり、窓からこぼれるお家のあかりがとてもきれいです。
//             ３階のお部屋「えんとつのお部屋」と「屋根ユニット」が取り外せるようになっています。
//             これらのお部屋を組みかえることで、３階建てのお家としても遊ぶことができます。`,
//             imagePath:"3.jpg",
//             price:1490
//         },
//         {
//             id:4,
//             name:"ハピネスチャージプリキュア! キュアライン",
//             description: `ハピネスチャージプリキュア!が使用するスマホ「キュアライン」が登場!!
//             流行のスタンプメールやTV電話でプリキュアたちとコミュニケーション!
//             メールがきたら選択をして返信!スタンプも送れる!メールは800パターン以上!
//             スタンプは100種類以上!
//             メール&TV電話で仲良し度を上げてプロフをゲット!
//             さらに、歴代プリキュアたちともスタンプメールができちゃう!
//             また、遊んで学べる知育アプリやゲーム、実用アプリがいっぱい!
//             タッチペンで文字や数字の書き方を学んだり、遊びながら学べる知育アプリが盛りだくさん。
//             さらに!専用ホームページからデータをダウンロードしてゲームやキャラクターを追加できる! 
//             (ゲーム、メールできるキャラクター、スタンプ)
//             使用電池:単4×4 (別売) 
//            【商品内容】キュアライン本体1個、タッチペン1個`,
//             imagePath:"4.jpg",
//             price:1900
//         },
//         {
//             id:5,
//             name:"こえだちゃん キキ & ララ 月のおうち",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"5.jpg",
//             price:1900
//         },
//         {
//             id:6,
//             name:"キラキラ プリキュアアラモード まぜまぜ変身!スイーツパクトDX",
//             description: `キラキラ プリキュアアラモードより、まぜまぜ変身!スイーツパクトDXが登場!
//             プリキュア5人全員の変身&攻撃あそびが楽しめるオールインワンセット!
//             スイーツづくりみたいな「まぜまぜアクション」で5人のなりきりあそびができる!!
            
//             セット内容:スイーツパクト本体 1個 まぜまぜスティック 1本 アニマルスイーツ 
//             うさぎショートケーキ1個 リスプリン1個 ライオンアイス1個 キャットマカロン1個 
//             ドッグチョコレート1個 ボールチェーン1個 使用電池:単4×2(別売)
            
//              ※デビューキャンペーンの先着購入特典、アニマルスイーツ「ペコリンムースケーキ」は付属しません。`,
//             imagePath:"6.jpg",
//             price:2700
//         },
//         {
//             id:7,
//             name:"アンパンマンタウン ようこそ！たのしいパンこうじょうハウス",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"7.jpg",
//             price:2570
//         },
//         {
//             id:8,
//             name:"人生ゲーム（2016年ver.）",
//             description: `人生ゲームシリーズのフラッグシップモデルが8年ぶりにリニューアル!! 
//             4つの追加エリアを組み合わせることで、色んなテイストの人生ゲームが楽しめます!組み合わせパターンは全16種。 
//             【セット内容】 
//             億万長者ステージ(1),追加用ステージ(仮)(4), 山(ゲーム版に貼り付いているもの以外)(1),
//             家(ゲーム版に貼りついているもの以外)(4), ビル群(1),追加ステージ用橋(4),橋(1),
//             自動車ゴマ(6色 各1個)(6),旗(6色 各1本)(6), 人物ピン(水色36本、ピンク36本))(72),
//             職業カード(A4サイズ)(1), お宝カード(A4サイズ)(1),保険証券(火災保険、生命保険、自動車保険)(24),
//             株券(8),お札一式(1)`,
//             imagePath:"8.jpg",
//             price:2160
//         },
//         {
//             id:9,
//             name:"野球盤 3Dエース",
//             description: `野球盤史上初！｢3Dピッチング機能｣を搭載し、ピッチャーの投球が本物のように飛びます！ 
//             オーバースローとアンダースローで投げ分けて、ホームランバッターに挑め！ めざせ！完・全・試・合！ 
//             [セット内容] 
//             野球盤本体1、電光掲示板1、ホームランフェンス（直線・曲線）各2、外周フェンス（照明パーツ含む）2、
//              グローブポケット4、バッターウィンドウ1、ボール6、バッター人形2、ピッチャー人形1、ランナー人形3、 
//              フィールダー人形7、カウントピン3、シール1、バット用ゴム3、取扱説明書1`,
//             imagePath:"9.jpg",
//             price:2700
//         },
//         {
//             id:10,
//             name:"ベイブレードバースト　B-86 スターター",
//             description: `ギミック付きのレイヤー搭載したディフェンスタイプの新型ベイブレード！ 
//             ※ライトランチャーLR付属 
            
//             ＜セット内容＞
//              レイヤー(1),ディスク(1),ドライバー(1),ランチャー(1),ワインダー(1),取説(1),シール(1)`,
//             imagePath:"10.jpg",
//             price:2160
//         },
//         {
//             id:11,
//             name:"仮面ライダーエグゼイド　ダブル装填　DXガシャコン キースラッシャー",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"11.jpg",
//             price:2700
//         },
//         {
//             id:12,
//             name:"トミカハイパーシリーズ ドライブヘッド",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"12.jpg",
//             price:2160
//         },
//         {
//             id:13,
//             name:"ミニ四駆スターターパック　MAパワータイプ（ブラストアロー",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"13.jpg",
//             price:2160
//         },
//         {
//             id:14,
//             name:"ミニ四駆スターターパック　MAパワータイプ（ブラストアロー）",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"14.jpg",
//             price:2980
//         },
//         {
//             id:15,
//             name:"機動戦士ガンダムZZ ダブルゼータガンダム",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"15.jpg",
//             price:2440
//         },
//         {
//             id:16,
//             name:"こえだちゃんと木のおうち",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"16.jpg",
//             price:2700
//         },
//         {
//             id:17,
//             name:"キラペットドーム <アクセパーティー>",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"17.jpg",
//             price:2440
//         },
//         {
//             id:1,
//             name:"おはじきシール ゆめかわDX",
//             description: `製品サイズ:(約)幅157×奥行157×高さ122cm
//             材質:塩化ビニル樹脂(非フタル酸系可塑剤使用)
//             水量目安:高さ22cmまで入れて295L
//             付属品:修理用パッチ
//             対象年齢:2歳以上
//             原産国:中国
//             INTEX社製のサンシェード付プール。
//             高さのある壁で安定します。
//             サンシェードは取り外し可能です。
//             プール底に排水口付き。
//             修理用パッチ付。
//             ご注意:子供は必ず、監視者のもとで遊ばせてください。
//             レンタル等による貸出、オークション等による販売や中古販売、
//             及び譲渡によって発生した故障・破損・損害・事故などにつきましては
//             一切責任を負いかねますので予めご了承ください。`,
//             imagePath:"18.jpg",
//             price:2700
//         },

//     ]
  
//     public get getTodos() {
//       return this.todos
//     }

//     public get getProducts() {
//         return this.items
//     }
  
//     public get getTodo() {
//       return (id: Number) => this.todos.find((todo) => todo.id === id)
//     }
  
//     public get getTodoCount() {
//       return this.todos.length
//     }
  
//     @Mutation
//     private add(todo: Product) {
//       this.todos.push(todo)
//     }
  
//     @Mutation
//     private remove(id: Number) {
//       this.todos = this.todos.filter((todo) => todo.id !== id)
//     }
  
//     @Mutation set(todos: Product[]) {
//       this.todos = todos
//     }
  
//   //   @Action({ rawError: true })
//   //   public async fetchTodos() {
//   //     const { data } = await $axios.get<Todo[]>('/api/todos')
//   //     this.set(data)
//   //   }
  
//   //   @Action({ rawError: true })
//   //   public async createTodo(payload: Todo) {
//   //     const { data } = await $axios.post<Todo>('/api/todo', payload)
//   //     this.add(data)
//   //   }
  
//   //   @Action({ rawError: true })
//   //   async deleteTodo(id: Number) {
//   //     await $axios.delete(`/api/todo/${id}`)
//   //     this.remove(id)
//   //   }
//   }